-----------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\\Reg_Dyn_Outros.log
  log type:  text
 opened on:  28 Jun 2022, 18:39:32

. 
. use "$dta\\Base_week_muni_flood.dta" , clear

. 
. global window=12  // em semanas

. 
. ********** POST PIX **********
. keep if week >= wofd(mdy(12, 1, 2020)) & week <= wofd(mdy(4, 30, 2022))
(857,353 observations deleted)

. *drop if moradores >= 100000
. 
. keep if  (date_w_disaster_mun >=  wofd(mdy(2, 1, 2021)) & date_w_disaster_mun <=  wofd(mdy(12, 31, 2021)) ) |  date_w_disaster_mun == .
(77,100 observations deleted)

. 
. cap drop dist_disaster_mun id_dist_disaster_mun

. 
. gen dist_disaster_mun=week-date_w_disaster_mun if abs(week-date_w)<=${window}&missing(date_w)==0
(328,132 missing values generated)

. replace dist_disaster_mun=-1 if missing(date_w_disaster_mun) & cem_weights>0
(295,125 real changes made)

. egen id_dist_disaster_mun=group(dist_disaster_mun)
(33,007 missing values generated)

. labmask id_dist_disaster_mun, values(dist_disaster_mun)

. 
. 
. * PIX quantidade de transações
. foreach var in     qtd_TED_intra  qtd_boleto {
  2.         cap drop l`var'
  3.         gen l`var'=log(`var' + 1)
  4.         eststo QTD:reghdfe l`var' ib${window}.id_dist_disaster_mun [aweight=cem_weights] if cem_weights>0&(abs(week-date_w)<=${window}|missing(date_w)
> ), ab(muni_cd week c.pc_moradores_3g#week) vce(cluster muni_cd) base 
  5. 
.         coefplot QTD, vertical yline(0, lcolor(black) lwidth(thin)) xline(12, lcolor(black) lwidth(thin) lpattern(dash)) levels(90)  graphregion(color(wh
> ite)) omitted baselevels  xtitle("Weeks after the disaster")  ytitle("`var'")  drop(_cons) 
  6.         
.         graph save Graph "$output\QTD_`var'.gph", replace
  7.         graph export "$output\QTD_`var'.png", replace
  8. 
. }
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =    303,896
Absorbing 3 HDFE groups                           F(  24,   4356) =       1.21
Statistics robust to heteroskedasticity           Prob > F        =     0.2183
                                                  R-squared       =     0.8660
                                                  Adj R-squared   =     0.8639
                                                  Within R-sq.    =     0.0001
Number of clusters (muni_cd) =      4,357         Root MSE        =     0.6801

                                    (Std. err. adjusted for 4,357 clusters in muni_cd)
--------------------------------------------------------------------------------------
                     |               Robust
      lqtd_TED_intra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
id_dist_disaster_mun |
                -12  |    .042729   .0356103     1.20   0.230    -.0270854    .1125433
                -11  |  -.0155077   .0343519    -0.45   0.652    -.0828549    .0518395
                -10  |  -.0018342   .0290826    -0.06   0.950    -.0588508    .0551824
                 -9  |  -.0168756   .0336443    -0.50   0.616    -.0828355    .0490843
                 -8  |   .0592326   .0360817     1.64   0.101    -.0115058     .129971
                 -7  |  -.0036919   .0317238    -0.12   0.907    -.0658866    .0585028
                 -6  |   .0283575   .0333926     0.85   0.396    -.0371091     .093824
                 -5  |  -.0357775   .0305739    -1.17   0.242     -.095718    .0241629
                 -4  |   .0273461   .0319253     0.86   0.392    -.0352437    .0899358
                 -3  |   .0037411   .0366294     0.10   0.919    -.0680713    .0755534
                 -2  |  -.0037418    .033678    -0.11   0.912    -.0697678    .0622843
                 -1  |          0  (base)
                  0  |   .0002908   .0363233     0.01   0.994    -.0709213    .0715028
                  1  |  -.0059785   .0414558    -0.14   0.885    -.0872529     .075296
                  2  |  -.0489826   .0426086    -1.15   0.250    -.1325172     .034552
                  3  |  -.0134092    .040988    -0.33   0.744    -.0937666    .0669482
                  4  |  -.0103105   .0440812    -0.23   0.815     -.096732    .0761111
                  5  |  -.0334084    .048007    -0.70   0.487    -.1275265    .0607097
                  6  |  -.0465385   .0463995    -1.00   0.316    -.1375052    .0444282
                  7  |  -.0237858   .0449049    -0.53   0.596    -.1118223    .0642507
                  8  |  -.0590416   .0446067    -1.32   0.186    -.1464933    .0284101
                  9  |  -.0310177   .0475114    -0.65   0.514    -.1241641    .0621288
                 10  |  -.0804716   .0486891    -1.65   0.098     -.175927    .0149837
                 11  |  -.0463956   .0493068    -0.94   0.347    -.1430619    .0502707
                 12  |  -.0738608   .0478978    -1.54   0.123    -.1677648    .0200432
                     |
               _cons |   2.351539   .0010638  2210.47   0.000     2.349454    2.353625
--------------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                muni_cd |      4357        4357           0    *|
                   week |        75           0          75     |
 week#c.pc_moradores_3g |        75           0          75    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
file \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\QTD_qtd_TED_intra.gph saved
file \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\\QTD_qtd_TED_intra.png saved as PNG format
(125,922 missing values generated)
(dropped 54 singleton observations)
(MWFE estimator converged in 16 iterations)

HDFE Linear regression                            Number of obs   =    191,784
Absorbing 3 HDFE groups                           F(  24,   4210) =       0.90
Statistics robust to heteroskedasticity           Prob > F        =     0.6090
                                                  R-squared       =     0.8523
                                                  Adj R-squared   =     0.8488
                                                  Within R-sq.    =     0.0002
Number of clusters (muni_cd) =      4,211         Root MSE        =     0.5147

                                    (Std. err. adjusted for 4,211 clusters in muni_cd)
--------------------------------------------------------------------------------------
                     |               Robust
         lqtd_boleto | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
id_dist_disaster_mun |
                -12  |  -.0602027   .0621429    -0.97   0.333    -.1820356    .0616303
                -11  |  -.0253311   .0617874    -0.41   0.682     -.146467    .0958048
                -10  |  -.0679423   .0550563    -1.23   0.217    -.1758818    .0399972
                 -9  |  -.0560041   .0590868    -0.95   0.343    -.1718454    .0598371
                 -8  |  -.0094029   .0642044    -0.15   0.884    -.1352773    .1164716
                 -7  |   .0373757   .0509681     0.73   0.463    -.0625486    .1373001
                 -6  |  -.0374964   .0486278    -0.77   0.441    -.1328326    .0578397
                 -5  |  -.0006081   .0636718    -0.01   0.992    -.1254385    .1242223
                 -4  |  -.0024582   .0429118    -0.06   0.954     -.086588    .0816716
                 -3  |  -.0710821   .0490158    -1.45   0.147    -.1671788    .0250147
                 -2  |   .0082703   .0650434     0.13   0.899    -.1192492    .1357897
                 -1  |          0  (base)
                  0  |  -.0818508   .0579829    -1.41   0.158    -.1955279    .0318264
                  1  |  -.0745753   .0726631    -1.03   0.305    -.2170333    .0678826
                  2  |  -.0428089   .0588145    -0.73   0.467    -.1581165    .0724986
                  3  |  -.0918417   .0564571    -1.63   0.104    -.2025275     .018844
                  4  |  -.1173948   .0684499    -1.72   0.086    -.2515928    .0168031
                  5  |  -.0657316   .0621364    -1.06   0.290    -.1875518    .0560886
                  6  |  -.0471261   .0644228    -0.73   0.465    -.1734287    .0791765
                  7  |   -.096509    .067939    -1.42   0.156    -.2297053    .0366874
                  8  |  -.0742739   .0666732    -1.11   0.265    -.2049886    .0564408
                  9  |  -.0364358    .069224    -0.53   0.599    -.1721514    .0992798
                 10  |  -.0914817   .0638162    -1.43   0.152    -.2165951    .0336316
                 11  |  -.0735649   .0689306    -1.07   0.286    -.2087052    .0615754
                 12  |  -.0849976   .0631789    -1.35   0.179    -.2088616    .0388664
                     |
               _cons |   1.839083   .0017145  1072.66   0.000     1.835721    1.842444
--------------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                muni_cd |      4211        4211           0    *|
                   week |        75           0          75     |
 week#c.pc_moradores_3g |        75           0          75    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
file \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\QTD_qtd_boleto.gph saved
file \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\\QTD_qtd_boleto.png saved as PNG format

. 
. * PIX Valores
. foreach var in  valor_boleto valor_TED_intra valor_cartao_debito valor_cartao_credito {
  2.         cap drop l`var'
  3.         gen l`var'=log(`var' + 1)
  4.         eststo VOLUME: reghdfe l`var' ib${window}.id_dist_disaster_mun [aweight=cem_weights] if cem_weights>0&(abs(week-date_w)<=${window}|missing(dat
> e_w)), ab(muni_cd week c.pc_moradores_3g#week) vce(cluster muni_cd) base 
  5.         
.         
.         *       coefplot VOLUME,  vertical drop(_cons) omit yline(0) xline(11.5,lcolor(gs0) lpattern(dash)) levels(90)
.                 coefplot VOLUME, vertical yline(0, lcolor(black) lwidth(thin)) xline(12, lcolor(black) lwidth(thin) lpattern(dash)) levels(90)  graphregi
> on(color(white)) omitted baselevels  xtitle("Weeks after the disaster")  ytitle("`var'")  drop(_cons) 
  6.         
.         graph save Graph "$output\VOL_`var'.gph", replace
  7.         graph export "$output\VOL_`var'.png", replace
  8. 
. }
(125,922 missing values generated)
(dropped 54 singleton observations)
(MWFE estimator converged in 16 iterations)

HDFE Linear regression                            Number of obs   =    191,784
Absorbing 3 HDFE groups                           F(  24,   4210) =       0.87
Statistics robust to heteroskedasticity           Prob > F        =     0.6453
                                                  R-squared       =     0.6694
                                                  Adj R-squared   =     0.6617
                                                  Within R-sq.    =     0.0001
Number of clusters (muni_cd) =      4,211         Root MSE        =     1.1333

                                    (Std. err. adjusted for 4,211 clusters in muni_cd)
--------------------------------------------------------------------------------------
                     |               Robust
       lvalor_boleto | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
id_dist_disaster_mun |
                -12  |  -.0256506   .0914137    -0.28   0.779    -.2048697    .1535685
                -11  |  -.0597834   .0903967    -0.66   0.508    -.2370086    .1174418
                -10  |  -.1295811   .0893364    -1.45   0.147    -.3047275    .0455654
                 -9  |   -.114367   .0946881    -1.21   0.227    -.3000055    .0712716
                 -8  |  -.0628536   .1043843    -0.60   0.547    -.2675018    .1417947
                 -7  |   -.087705   .0936561    -0.94   0.349    -.2713203    .0959103
                 -6  |  -.0281999    .085528    -0.33   0.742    -.1958799      .13948
                 -5  |  -.0999811   .0992983    -1.01   0.314    -.2946582    .0946959
                 -4  |   .0219174   .0960953     0.23   0.820      -.16648    .2103149
                 -3  |  -.0927496   .0962714    -0.96   0.335    -.2814924    .0959932
                 -2  |  -.0294426   .0933495    -0.32   0.752     -.212457    .1535717
                 -1  |          0  (base)
                  0  |  -.1449665   .1022234    -1.42   0.156    -.3453783    .0554454
                  1  |  -.1085466   .0925215    -1.17   0.241    -.2899377    .0728444
                  2  |  -.1314473   .0947194    -1.39   0.165    -.3171472    .0542527
                  3  |  -.0900268   .0963696    -0.93   0.350    -.2789621    .0989084
                  4  |  -.1828871   .0977367    -1.87   0.061    -.3745026    .0087285
                  5  |   .0597276   .0960941     0.62   0.534    -.1286675    .2481228
                  6  |  -.0964659   .0959586    -1.01   0.315    -.2845954    .0916636
                  7  |  -.0775523   .0884125    -0.88   0.380    -.2508875    .0957828
                  8  |  -.0757529   .0935022    -0.81   0.418    -.2590666    .1075607
                  9  |  -.0710638   .1036882    -0.69   0.493    -.2743475    .1322198
                 10  |  -.0788226   .0977497    -0.81   0.420    -.2704636    .1128185
                 11  |  -.1170708   .0979699    -1.19   0.232    -.3091435    .0750019
                 12  |  -.2002426   .0853504    -2.35   0.019    -.3675745   -.0329108
                     |
               _cons |   7.238524   .0023261  3111.82   0.000     7.233963    7.243084
--------------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                muni_cd |      4211        4211           0    *|
                   week |        75           0          75     |
 week#c.pc_moradores_3g |        75           0          75    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
file \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\VOL_valor_boleto.gph saved
file \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\\VOL_valor_boleto.png saved as PNG format
(85,528 missing values generated)
(dropped 1 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =    227,312
Absorbing 3 HDFE groups                           F(  24,   4355) =       1.34
Statistics robust to heteroskedasticity           Prob > F        =     0.1220
                                                  R-squared       =     0.7775
                                                  Adj R-squared   =     0.7730
                                                  Within R-sq.    =     0.0001
Number of clusters (muni_cd) =      4,356         Root MSE        =     1.1070

                                    (Std. err. adjusted for 4,356 clusters in muni_cd)
--------------------------------------------------------------------------------------
                     |               Robust
    lvalor_TED_intra | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
id_dist_disaster_mun |
                -12  |  -.0658009   .0758767    -0.87   0.386    -.2145578    .0829561
                -11  |  -.1035317   .0695461    -1.49   0.137    -.2398774     .032814
                -10  |  -.1361767   .0643944    -2.11   0.035    -.2624224   -.0099309
                 -9  |   -.157156   .0663537    -2.37   0.018    -.2872431   -.0270689
                 -8  |   .0330098   .0771459     0.43   0.669    -.1182354    .1842549
                 -7  |   -.039608   .0711206    -0.56   0.578    -.1790406    .0998245
                 -6  |  -.0412684   .0678772    -0.61   0.543    -.1743423    .0918054
                 -5  |  -.1832622   .0692878    -2.64   0.008    -.3191016   -.0474228
                 -4  |  -.0583027   .0730681    -0.80   0.425    -.2015534    .0849479
                 -3  |  -.0743844   .0711765    -1.05   0.296    -.2139266    .0651578
                 -2  |   -.112732   .0711564    -1.58   0.113    -.2522347    .0267708
                 -1  |          0  (base)
                  0  |  -.0559259   .0731478    -0.76   0.445    -.1993328    .0874811
                  1  |   .0694158   .0778055     0.89   0.372    -.0831227    .2219542
                  2  |  -.0525399   .0749606    -0.70   0.483    -.1995008     .094421
                  3  |  -.0350791   .0681611    -0.51   0.607    -.1687096    .0985514
                  4  |  -.0075611   .0779148    -0.10   0.923    -.1603136    .1451915
                  5  |   .0798142   .0839286     0.95   0.342    -.0847286    .2443569
                  6  |  -.1130322     .09768    -1.16   0.247    -.3045348    .0784704
                  7  |  -.0226607   .0759931    -0.30   0.766    -.1716458    .1263244
                  8  |  -.0913387   .0796129    -1.15   0.251    -.2474204    .0647431
                  9  |   .1234078   .0873351     1.41   0.158    -.0478135    .2946292
                 10  |  -.0436216   .0916202    -0.48   0.634    -.2232438    .1360007
                 11  |   .0296594   .0888925     0.33   0.739     -.144615    .2039339
                 12  |  -.0804996   .0994553    -0.81   0.418    -.2754826    .1144835
                     |
               _cons |   12.73718   .0017507  7275.31   0.000     12.73375    12.74061
--------------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                muni_cd |      4356        4356           0    *|
                   week |        57           0          57     |
 week#c.pc_moradores_3g |        57           0          57    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
file \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\VOL_valor_TED_intra.gph saved
file \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\\VOL_valor_TED_intra.png saved as PNG format
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =    303,896
Absorbing 3 HDFE groups                           F(  24,   4356) =       5.01
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9885
                                                  Adj R-squared   =     0.9883
                                                  Within R-sq.    =     0.0004
Number of clusters (muni_cd) =      4,357         Root MSE        =     0.1947

                                    (Std. err. adjusted for 4,357 clusters in muni_cd)
--------------------------------------------------------------------------------------
                     |               Robust
lvalor_cartao_debito | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
id_dist_disaster_mun |
                -12  |   .0167772   .0132787     1.26   0.206    -.0092559    .0428102
                -11  |   .0101505     .01226     0.83   0.408    -.0138854    .0341864
                -10  |   .0123827   .0117501     1.05   0.292    -.0106534    .0354189
                 -9  |   -.002024   .0109922    -0.18   0.854    -.0235742    .0195263
                 -8  |   .0050718   .0126834     0.40   0.689    -.0197942    .0299377
                 -7  |   .0020493   .0115017     0.18   0.859    -.0204999    .0245985
                 -6  |  -.0083549   .0110643    -0.76   0.450    -.0300466    .0133368
                 -5  |  -.0058635     .01026    -0.57   0.568    -.0259782    .0142512
                 -4  |  -.0094949    .011893    -0.80   0.425    -.0328113    .0138215
                 -3  |  -.0358932   .0108552    -3.31   0.001    -.0571749   -.0146115
                 -2  |  -.0059995   .0096005    -0.62   0.532    -.0248214    .0128224
                 -1  |          0  (base)
                  0  |   -.023735   .0098485    -2.41   0.016    -.0430431    -.004427
                  1  |   .0275179   .0112556     2.44   0.015     .0054512    .0495846
                  2  |   .0389644   .0098889     3.94   0.000     .0195771    .0583517
                  3  |   .0395835    .009809     4.04   0.000     .0203528    .0588141
                  4  |   .0324414   .0116601     2.78   0.005     .0095816    .0553012
                  5  |   .0240083    .012371     1.94   0.052    -.0002451    .0482617
                  6  |   .0297266   .0127897     2.32   0.020     .0046523    .0548009
                  7  |   .0525071   .0153252     3.43   0.001     .0224619    .0825524
                  8  |   .0377629   .0157781     2.39   0.017     .0068299     .068696
                  9  |   .0226471   .0172006     1.32   0.188    -.0110748    .0563691
                 10  |   .0311189   .0169397     1.84   0.066    -.0020916    .0643294
                 11  |   .0224931   .0132687     1.70   0.090    -.0035203    .0485066
                 12  |   .0098401   .0133606     0.74   0.461    -.0163535    .0360337
                     |
               _cons |   12.47309   .0002997  4.2e+04   0.000      12.4725    12.47368
--------------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                muni_cd |      4357        4357           0    *|
                   week |        75           0          75     |
 week#c.pc_moradores_3g |        75           0          75    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
file \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\VOL_valor_cartao_debito.gph saved
file \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\\VOL_valor_cartao_debito.png saved as PNG format
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =    303,896
Absorbing 3 HDFE groups                           F(  24,   4356) =       1.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0075
                                                  R-squared       =     0.9813
                                                  Adj R-squared   =     0.9810
                                                  Within R-sq.    =     0.0001
Number of clusters (muni_cd) =      4,357         Root MSE        =     0.2865

                                    (Std. err. adjusted for 4,357 clusters in muni_cd)
--------------------------------------------------------------------------------------
                     |               Robust
lvalor_cartao_cred~o | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
id_dist_disaster_mun |
                -12  |   .0065729   .0162861     0.40   0.687    -.0253563     .038502
                -11  |     .03801   .0160497     2.37   0.018     .0065445    .0694755
                -10  |   .0301308   .0160996     1.87   0.061    -.0014326    .0616941
                 -9  |   .0083894   .0146306     0.57   0.566     -.020294    .0370729
                 -8  |   .0066842   .0150364     0.44   0.657    -.0227948    .0361633
                 -7  |   .0102976   .0148681     0.69   0.489    -.0188514    .0394467
                 -6  |   .0104894   .0147589     0.71   0.477    -.0184456    .0394243
                 -5  |   -.013697   .0117802    -1.16   0.245    -.0367922    .0093981
                 -4  |   .0007559    .014851     0.05   0.959    -.0283597    .0298715
                 -3  |  -.0094163   .0120272    -0.78   0.434    -.0329957     .014163
                 -2  |   .0018455   .0131765     0.14   0.889    -.0239872    .0276781
                 -1  |          0  (base)
                  0  |  -.0076327   .0123634    -0.62   0.537    -.0318713    .0166059
                  1  |   .0145355   .0127929     1.14   0.256    -.0105451    .0396161
                  2  |   .0065103   .0129038     0.50   0.614    -.0187877    .0318083
                  3  |   .0163147   .0114608     1.42   0.155    -.0061543    .0387838
                  4  |  -.0084851   .0130401    -0.65   0.515    -.0340503      .01708
                  5  |   .0110145   .0147417     0.75   0.455    -.0178867    .0399158
                  6  |   .0295301   .0154987     1.91   0.057    -.0008553    .0599154
                  7  |   .0349467   .0152101     2.30   0.022     .0051272    .0647662
                  8  |   .0125127   .0141965     0.88   0.378    -.0153196    .0403449
                  9  |   .0125024   .0146312     0.85   0.393    -.0161823    .0411871
                 10  |   .0191564    .015455     1.24   0.215    -.0111432    .0494559
                 11  |   .0324895   .0157012     2.07   0.039     .0017071     .063272
                 12  |   .0237895   .0146056     1.63   0.103     -.004845    .0524239
                     |
               _cons |   11.71544   .0003672  3.2e+04   0.000     11.71472    11.71616
--------------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                muni_cd |      4357        4357           0    *|
                   week |        75           0          75     |
 week#c.pc_moradores_3g |        75           0          75    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
file \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\VOL_valor_cartao_credito.gph saved
file \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\\VOL_valor_cartao_credito.png saved as PNG format

. 
. 
. log close
      name:  <unnamed>
       log:  \\sbcdf060\depepmetas$\usuarios\Jose Renato\Projetos\PIX_Matheus\\Reg_Dyn_Outros.log
  log type:  text
 closed on:  28 Jun 2022, 18:42:30
-----------------------------------------------------------------------------------------------------------------------------------------------------------
